#!/bin/bash
PATH=/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/bin:/sbin
export PATH

echo "#####		百度云CDN延迟测试v1.0	 	#####"
echo "#####		By: Linux_Terminal		#####"
echo "#####		Update:2020-03-16		#####"
echo " "
echo -e "\033[42;37m 回车以继续，ctrl+C退出...... \033[0m"
read -n 1





location=(
		'东莞 电信'
		'郑州 联通'
		'天津 移动'
		'沈阳 联通'
		'广州 移动'
		'石家庄 联通'
		'济南 联通'
		'武汉 联通'
		'无锡 移动'
		'西安 电信'
        '青岛 电信'
        '株洲 电信'
        '苏州 电信'
        '广州 联通'
        '宁波 电信'
        '天津 联通'
        '重庆 联通'
        '南宁 电信'
        '天津 电信'
        '上海 电信'
        '上海 电信'
	)
#各地区DNS，来源于http://dns.lisect.com/ and https://www.ip.cn/dns.html
dnsip=(
	    '119.147.134.46'	#东莞 电信
		'42.236.94.46'      #郑州 联通
		'111.32.136.46'     #天津 移动
		'124.95.191.46'     #沈阳 联通
		'183.232.53.46'     #广州 移动
        '61.182.136.46'     #石家庄 联通
		'119.188.97.46'     #济南 联通
		'122.190.3.46'      #武汉 联通
		'112.25.91.46'      #无锡 移动
		'117.34.14.46'      #西安 电信
        '150.138.151.46'    #青岛 电信
        '220.170.186.46'    #株洲 电信
        '58.211.137.46'     #苏州 电信
        '157.255.26.46'     #广州 联通
        '115.231.187.46'    #宁波 电信
        '125.39.174.46'     #天津 联通
        '113.207.102.47'    #重庆 联通
        '219.159.84.46'     #南宁 电信
        '42.81.8.46'        #天津 电信
        '180.163.189.0'     #上海 电信
        '180.163.113.20'    #上海 电信
)

function mping(){
	num=0
	#Ping次数
	pnum=$1

	echo '---------------------------------------------------------------------------'
	echo -e "\033[42;37m 正在进行Ping测试，请稍后... \033[0m"
	echo '---------------------------------------------------------------------------'

	while(( $num<21 ))
	do
		ping ${dnsip[$num]} -c $pnum > /tmp/${dnsip[$num]}.txt
		echo -e "\033[41;33m【${location[$num]}】\033[0m" - "\033[34m${dnsip[$num]}\033[0m"
		echo ''
		tail -2 /tmp/${dnsip[$num]}.txt
		echo '---------------------------------------------------------------------------'
		let "num++"
	done
	echo "【参数说明】"
	echo "x% packet loss: 丢包率"
	echo "min: 最低延迟"
	echo "avg: 平均延迟"
	echo "max: 最高延迟"
	echo "mdev: 平均偏差"

	echo '---------------------------------------------------------------------------'
}
mping 10
